GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Inc/fm33lr0xx_fl_lptim16.h
#define    LPTIM16_CFGR_TMODE_Pos                                 (0U)
#define    LPTIM16_CFGR_TMODE_Msk                                 (0x3U << LPTIM16_CFGR_TMODE_Pos)
#define    LPTIM16_CFGR_TMODE                                     LPTIM16_CFGR_TMODE_Msk

#define    LPTIM16_IER_OVRIE_Pos                                  (8U)
#define    LPTIM16_IER_OVRIE_Msk                                  (0x3U << LPTIM16_IER_OVRIE_Pos)
#define    LPTIM16_IER_OVRIE                                      LPTIM16_IER_OVRIE_Msk

#define    LPTIM16_IER_TRIGIE_Pos                                 (7U)
#define    LPTIM16_IER_TRIGIE_Msk                                 (0x1U << LPTIM16_IER_TRIGIE_Pos)
#define    LPTIM16_IER_TRIGIE                                     LPTIM16_IER_TRIGIE_Msk

#define    LPTIM16_IER_OVIE_Pos                                   (6U)
#define    LPTIM16_IER_OVIE_Msk                                   (0x1U << LPTIM16_IER_OVIE_Pos)
#define    LPTIM16_IER_OVIE                                       LPTIM16_IER_OVIE_Msk

#define    LPTIM16_IER_QDCIE_Pos                                  (5U)
#define    LPTIM16_IER_QDCIE_Msk                                  (0x1U << LPTIM16_IER_QDCIE_Pos)
#define    LPTIM16_IER_QDCIE                                      LPTIM16_IER_QDCIE_Msk

#define    LPTIM16_IER_CCIE_Pos                                   (0U)
#define    LPTIM16_IER_CCIE_Msk                                   (0x3U << LPTIM16_IER_CCIE_Pos)
#define    LPTIM16_IER_CCIE                                       LPTIM16_IER_CCIE_Msk

#define    LPTIM16_ISR_QDIR_Pos                                   (13U)
#define    LPTIM16_ISR_QDIR_Msk                                   (0x1U << LPTIM16_ISR_QDIR_Pos)
#define    LPTIM16_ISR_QDIR                                       LPTIM16_ISR_QDIR_Msk

#define    LPTIM16_ISR_OVRIF_Pos                                  (8U)
#define    LPTIM16_ISR_OVRIF_Msk                                  (0x3U << LPTIM16_ISR_OVRIF_Pos)
#define    LPTIM16_ISR_OVRIF                                      LPTIM16_ISR_OVRIF_Msk

#define    LPTIM16_ISR_TRIGIF_Pos                                 (7U)
#define    LPTIM16_ISR_TRIGIF_Msk                                 (0x1U << LPTIM16_ISR_TRIGIF_Pos)
#define    LPTIM16_ISR_TRIGIF                                     LPTIM16_ISR_TRIGIF_Msk

#define    LPTIM16_ISR_OVIF_Pos                                   (6U)
#define    LPTIM16_ISR_OVIF_Msk                                   (0x1U << LPTIM16_ISR_OVIF_Pos)
#define    LPTIM16_ISR_OVIF                                       LPTIM16_ISR_OVIF_Msk


#define    LPTIM16_ISR_QDCIF_Pos                                  (5U)
#define    LPTIM16_ISR_QDCIF_Msk                                  (0x1U << LPTIM16_ISR_QDCIF_Pos)
#define    LPTIM16_ISR_QDCIF                                      LPTIM16_ISR_QDCIF_Msk

#define    LPTIM16_ISR_CCIF_Pos                                   (0U)
#define    LPTIM16_ISR_CCIF_Msk                                   (0x3U << LPTIM16_ISR_CCIF_Pos)
#define    LPTIM16_ISR_CCIF                                       LPTIM16_ISR_CCIF_Msk

#define    LPTIM16_CCSR_CAP1PSC_Pos                               (26U)
#define    LPTIM16_CCSR_CAP1PSC_Msk                               (0x3fU << LPTIM16_CCSR_CAP1PSC_Pos)
#define    LPTIM16_CCSR_CAP1PSC                                   LPTIM16_CCSR_CAP1PSC_Msk

#define    LPTIM16_CCSR_CAP1SSEL_Pos                              (24U)
#define    LPTIM16_CCSR_CAP1SSEL_Msk                              (0x3U << LPTIM16_CCSR_CAP1SSEL_Pos)
#define    LPTIM16_CCSR_CAP1SSEL                                  LPTIM16_CCSR_CAP1SSEL_Msk

#define    LPTIM16_CCSR_CAPEDGE_Pos                               (20U)
#define    LPTIM16_CCSR_CAPEDGE_Msk                               (0x1U << LPTIM16_CCSR_CAPEDGE_Pos)
#define    LPTIM16_CCSR_CAPEDGE                                   LPTIM16_CCSR_CAPEDGE_Msk

#define    LPTIM16_CCSR_CCP_Pos                                   (16U)
#define    LPTIM16_CCSR_CCP_Msk                                   (0x1U << LPTIM16_CCSR_CCP_Pos)
#define    LPTIM16_CCSR_CCP                                       LPTIM16_CCSR_CCP_Msk

#define    LPTIM16_CCSR_CAPCFG_Pos                                (8U)
#define    LPTIM16_CCSR_CAPCFG_Msk                                (0x3U << LPTIM16_CCSR_CAPCFG_Pos)
#define    LPTIM16_CCSR_CAPCFG                                    LPTIM16_CCSR_CAPCFG_Msk

#define    LPTIM16_CCSR_CCS_Pos                                   (0U)
#define    LPTIM16_CCSR_CCS_Msk                                   (0x3U << LPTIM16_CCSR_CCS_Pos)
#define    LPTIM16_CCSR_CCS                                       LPTIM16_CCSR_CCS_Msk


#define    FL_LPTIM16_CHANNEL_1                                   (0x1U << 0U)
#define    FL_LPTIM16_CHANNEL_2                                   (0x1U << 1U)


#define    FL_LPTIM16_CLK_SOURCE_INTERNAL                         (0x0U << LPTIM16_CFGR_PSCSEL_Pos)
#define    FL_LPTIM16_CLK_SOURCE_EXTERNAL                         (0x1U << LPTIM16_CFGR_PSCSEL_Pos)


#define    FL_LPTIM16_PSC_DIV1                                    (0x0U << LPTIM16_CFGR_DIVSEL_Pos)
#define    FL_LPTIM16_PSC_DIV2                                    (0x1U << LPTIM16_CFGR_DIVSEL_Pos)
#define    FL_LPTIM16_PSC_DIV4                                    (0x2U << LPTIM16_CFGR_DIVSEL_Pos)
#define    FL_LPTIM16_PSC_DIV8                                    (0x3U << LPTIM16_CFGR_DIVSEL_Pos)
#define    FL_LPTIM16_PSC_DIV16                                   (0x4U << LPTIM16_CFGR_DIVSEL_Pos)
#define    FL_LPTIM16_PSC_DIV32                                   (0x5U << LPTIM16_CFGR_DIVSEL_Pos)
#define    FL_LPTIM16_PSC_DIV64                                   (0x6U << LPTIM16_CFGR_DIVSEL_Pos)
#define    FL_LPTIM16_PSC_DIV128                                  (0x7U << LPTIM16_CFGR_DIVSEL_Pos)


#define    FL_LPTIM16_ETR_COUNT_EDGE_RISING                       (0x0U << LPTIM16_CFGR_EDGESEL_Pos)
#define    FL_LPTIM16_ETR_COUNT_EDGE_FALLING                      (0x1U << LPTIM16_CFGR_EDGESEL_Pos)


#define    FL_LPTIM16_ETR_TRIGGER_EDGE_RISING                     (0x0U << LPTIM16_CFGR_TRIGCFG_Pos)
#define    FL_LPTIM16_ETR_TRIGGER_EDGE_FALLING                    (0x1U << LPTIM16_CFGR_TRIGCFG_Pos)
#define    FL_LPTIM16_ETR_TRIGGER_EDGE_BOTH                       (0x2U << LPTIM16_CFGR_TRIGCFG_Pos)


#define    FL_LPTIM16_ENCODER_MODE_DISABLE                        (0x0U << LPTIM16_CFGR_QEMD_Pos)
#define    FL_LPTIM16_ENCODER_MODE_TI1FP1_TI2FP2_CNT              (0x1U << LPTIM16_CFGR_QEMD_Pos)
#define    FL_LPTIM16_ENCODER_MODE_TI2FP2_TI1FP1_CNT              (0x2U << LPTIM16_CFGR_QEMD_Pos)
#define    FL_LPTIM16_ENCODER_MODE_TI2FP2_CNT_TI1FP1_CNT          (0x3U << LPTIM16_CFGR_QEMD_Pos)


#define    FL_LPTIM16_TRGO_ENABLE                                 (0x1U << LPTIM16_CFGR_MMS_Pos)
#define    FL_LPTIM16_TRGO_UPDATE                                 (0x2U << LPTIM16_CFGR_MMS_Pos)
#define    FL_LPTIM16_TRGO_CCIF                                   (0x3U << LPTIM16_CFGR_MMS_Pos)
#define    FL_LPTIM16_TRGO_OC1REF                                 (0x4U << LPTIM16_CFGR_MMS_Pos)
#define    FL_LPTIM16_TRGO_OC2REF                                 (0x5U << LPTIM16_CFGR_MMS_Pos)


#define    FL_LPTIM16_ONE_PULSE_MODE_CONTINUOUS                   (0x0U << LPTIM16_CFGR_ONST_Pos)
#define    FL_LPTIM16_ONE_PULSE_MODE_SINGLE                       (0x1U << LPTIM16_CFGR_ONST_Pos)


#define    FL_LPTIM16_OPERATION_MODE_NORMAL                       (0x0U << LPTIM16_CFGR_TMODE_Pos)
#define    FL_LPTIM16_OPERATION_MODE_EXTERNAL_TRIGGER_CNT         (0x1U << LPTIM16_CFGR_TMODE_Pos)
#define    FL_LPTIM16_OPERATION_MODE_EXTERNAL_ASYNC_PULSE_CNT     (0x2U << LPTIM16_CFGR_TMODE_Pos)
#define    FL_LPTIM16_OPERATION_MODE_TIMEOUT                      (0x3U << LPTIM16_CFGR_TMODE_Pos)


#define    FL_LPTIM16_IC_EDGE_RISING                              (0x0U << LPTIM16_CCSR_CAPCFG_Pos)
#define    FL_LPTIM16_IC_EDGE_FALLING                             (0x1U << LPTIM16_CCSR_CAPCFG_Pos)
#define    FL_LPTIM16_IC_EDGE_BOTH                                (0x2U << LPTIM16_CCSR_CAPCFG_Pos)


#define    FL_LPTIM16_OC_POLARITY_NORMAL                          (0x0U << LPTIM16_CCSR_CCP_Pos)
#define    FL_LPTIM16_OC_POLARITY_INVERT                          (0x1U << LPTIM16_CCSR_CCP_Pos)


#define    FL_LPTIM16_IC_POLARITY_NORMAL                          (0x0U << LPTIM16_CCSR_CCP_Pos)
#define    FL_LPTIM16_IC_POLARITY_INVERT                          (0x1U << LPTIM16_CCSR_CCP_Pos)


#define    FL_LPTIM16_CHANNEL_MODE_DISABLE                        (0x0U << LPTIM16_CCSR_CCS_Pos)
#define    FL_LPTIM16_CHANNEL_MODE_INPUT                          (0x1U << LPTIM16_CCSR_CCS_Pos)
#define    FL_LPTIM16_CHANNEL_MODE_OUTPUT                         (0x2U << LPTIM16_CCSR_CCS_Pos)


